app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
{
    if(addon_is_activated('portfolio_system') && get_setting('customer_verification')){
        $data['verification_status'] = 0;
    }

    // ✅ Clean phone
    $phone = preg_replace('/\D+/', '', $data['phone']);

    // ✅ Email prefix (first 3 letters)
    $emailPrefix = isset($data['email']) ? substr($data['email'], 0, 3) : 'USR';

    // ✅ Generate UNIQUE referral code
    do {
        $random = strtoupper(substr(str_shuffle('ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789'), 0, 3));

        $referral_code = strtoupper($emailPrefix)
            . substr($phone, 0, 2)
            . substr($phone, -2)
            . $random;

    } while (User::where('referral_code', $referral_code)->exists());


    // ✅ Create user (SINGLE LOGIC - CLEAN)
    $user = User::create([
        'name' => $data['name'],
        'email' => $data['email'] ?? null,
        'phone' => $phone, // ✅ FIXED STORAGE
        'password' => Hash::make($data['password']),
        'verification_status' => $data['verification_status'] ?? 1,
        'referral_code' => $referral_code,
        'user_type' => 'customer',
          'is_active' => 2, // Pending Approval
    ]);
---
select exists(select * from `users` where `referral_code` = 'ADA6787KJM') as `exists`
insert into `users` (`name`, `email`, `phone`, `password`, `verification_status`, `referral_code`, `user_type`, `is_active`, `updated_at`, `created_at`) values ('adarsh', 'adarsh@gmail.com', '6787898987', '$2y$10$dSvnVpT3/tc/D0wUEcCFJ..lz.nN6OVbl97rqy7D8Orer3flOq7dm', 1, 'ADA6787KJM', 'customer', 2, '2026-06-17 11:03:42', '2026-06-17 11:03:42')


    // ✅ Referral Logic (KEEP SAME)
    if (!empty($data['referred_by_code'])) {
        $refUser = User::where('referral_code', $data['referred_by_code'])->first();
        if ($refUser) {
            $user->referred_by = $refUser->id;
            $user->save();
---
select * from `users` where `referral_code` = '12R9147SU4' limit 1
update `users` set `referred_by` = 27, `users`.`updated_at` = '2026-06-17 11:03:42' where `id` = 55

    public function register(Request $request)
    {
        //dd($request->all());
        if (filter_var($request->email, FILTER_VALIDATE_EMAIL)) {
            if(User::where('email', $request->email)->first() != null){
                flash(translate('Email or Phone already exists.'));
                return back();

            }
        }
        elseif (User::where('phone', '+'.$request->country_code.$request->phone)->first() != null) {
            flash(translate('Phone already exists.'));
            return back();
        }

        $this->validator($request->all())->validate();

        $user = $this->create($request->all());

        $this->guard()->login($user);

        if($user->email != null){
            if(BusinessSetting::where('type', 'email_verification')->first()->value != 1 || get_setting('customer_registration_verify') === '1'){
                $user->email_verified_at = date('Y-m-d H:m:s');
                $user->save();
---
select * from `users` where `email` = 'adarsh@gmail.com' limit 1
select * from `business_settings` where `type` = 'email_verification' limit 1
update `users` set `email_verified_at` = '2026-06-17 11:06:42', `users`.`updated_at` = '2026-06-17 11:03:42' where `id` = 55