app/Http/Controllers/AgentController.php

select count(*) as aggregate from `users` where `referred_by` = 56 and `user_type` = 'customer'
select count(*) as aggregate from `users` where `referred_by` = 56 and `user_type` = 'seller'
select count(*) as aggregate from `users` where `referred_by` = 56 and `user_type` = 'customer' and date(`created_at`) = '2026-06-17'
select count(*) as aggregate from `users` where `referred_by` = 56 and `user_type` = 'seller' and date(`created_at`) = '2026-06-17'
select * from `agent_targets` where `agent_id` = 56 limit 1
---
public function agentDashboard()
{
    $totalUsers = User::where('referred_by', Auth::id())
        ->where('user_type', 'customer')
        ->count();

    $totalVendors = User::where('referred_by', Auth::id())
        ->where('user_type', 'seller')
        ->count();

    $todayUsers = User::where('referred_by', Auth::id())
        ->where('user_type', 'customer')
        ->whereDate('created_at', today())
        ->count();

    $todayVendors = User::where('referred_by', Auth::id())
        ->where('user_type', 'seller')
        ->whereDate('created_at', today())
        ->count();


        $target = DB::table('agent_targets')
            ->where('agent_id',Auth::id())
            ->first();

$userTarget = $target->user_target ?? 0;
$vendorTarget = $target->vendor_target ?? 0;

$totalUsers = User::where('referred_by', Auth::id())
    ->where('user_type','customer')
    ->count();

$totalVendors = User::where('referred_by', Auth::id())
    ->where('user_type','seller')
    ->count();

select count(*) as aggregate from `users` where `referred_by` = 41 and `user_type` = 'customer'
select count(*) as aggregate from `users` where `referred_by` = 41 and `user_type` = 'seller'
---
    $vendorTarget > 0 &&
    $totalVendors >= $vendorTarget;

    $totalUsersCreated = User::where('referred_by', Auth::id())
    ->where('user_type', 'customer')
    ->count();

$totalVendorsCreated = User::where('referred_by', Auth::id())
    ->where('user_type', 'seller')
    ->count();

select * from `users` where `referred_by` = 56 and `user_type` = 'customer' and `is_active` = 1 order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `users` where `referred_by` = 56 and `user_type` = 'customer' and `is_active` = 1
---
public function users(Request $request)
{
    $status = $request->status ?? 'active';

    $users = User::where('referred_by', Auth::id())
        ->where('user_type', 'customer');

    if ($status == 'active') {
        $users->where('is_active', 1);
    } else {
        $users->where('is_active', 2);
    }

    $users = $users->latest()->paginate(20);