app/Http/Controllers/CheckoutController.php

select * from `addresses` where `user_id` = 32
select * from `addresses` where `addresses`.`id` in (7) limit 1
select * from `addresses` where `addresses`.`id` in (7) and `set_default` = 1 limit 1
---
    public function index(Request $request)
    {
        if(get_setting('guest_checkout_activation') == 0 && auth()->user() == null){
            return redirect()->route('user.login');
        }

        if(auth()->check() && !$request->user()->hasVerifiedEmail()){
            return redirect()->route('verification.notice');
        }

        $country_id = 0;
        $city_id = 0;
        $area_id=0;
        $address_id = 0;
        $shipping_info = array();

        if (auth()->check()) {
            $user_id = Auth::user()->id;
            $carts = Cart::where('user_id', $user_id)->active()->get();
            $addresses = Address::where('user_id', $user_id)->get();
            if(count($addresses)){
                $address = $addresses->toQuery()->first();
                $address_id = $address->id;
                $country_id = $address->country_id;
                $city_id = $address->city_id;
                $area_id = $address->area_id;
                $default_address =$addresses->toQuery()->where('set_default', 1)->first();

select * from `carts` where `id` in (83)
---
        }
        else {
            $temp_user_id = $request->session()->get('temp_user_id');
            $carts = ($temp_user_id != null) ? Cart::where('temp_user_id', $temp_user_id)->active()->get() : [];

update `carts` set `address_id` = 7, `carts`.`updated_at` = '2026-06-17 13:37:08' where `carts`.`id` in (83)
---
        $default_shipping_type = 'home_delivery';

        if ($carts && count($carts) > 0) {
            $carts->toQuery()->update(['address_id' => $address_id]);

select * from `products` where `products`.`id` = 29 limit 1
---
            }

            foreach ($carts as $key => $cartItem) {
                $product = Product::find($cartItem['product_id']);

update `carts` set `shipping_type` = 'home_delivery', `carts`.`updated_at` = '2026-06-17 13:37:08' where `id` = 83
---
                $cartItem['shipping_type'] = $default_shipping_type;
                $cartItem['carrier_id'] = $default_carrier_id;
                $shipping += $cartItem['shipping_cost'];
                $cartItem->save();

select sum(`pt_value`) as aggregate from `mlm_wallet` where `user_id` = 32 and `wallet_status` = 1
select sum(`amount`) as aggregate from `mlm_withdraw_requests` where `user_id` = 32 and `status` = 'approved'
select sum(`mlm_wallet_used`) as aggregate from `orders` where `user_id` = 32
---

if(auth()->check()){

    $earning = DB::table('mlm_wallet')
        ->where('user_id', auth()->id())
        ->where('wallet_status', 1)
        ->sum('pt_value');

    $withdrawn = DB::table('mlm_withdraw_requests')
        ->where('user_id', auth()->id())
        ->where('status', 'approved')
        ->sum('amount');

    $walletUsedInOrders = DB::table('orders')
        ->where('user_id', auth()->id())
        ->sum('mlm_wallet_used');

delete from `carts` where `carts`.`id` in (82)
---
        (new OrderController)->store($request);

        if(count($carts) > 0){
            $carts->toQuery()->delete();