app/Http/Controllers/HomeController.php

insert into `user_kyc` (`user_id`, `is_bank`, `is_aadhar`, `is_pan`, `updated_at`, `created_at`) values (55, 2, 2, 2, '2026-06-17 11:04:14', '2026-06-17 11:04:14')
select * from `user_kyc` where (`user_id` = 26) and `user_kyc`.`deleted_at` is null limit 1
select * from `carts` where `user_id` = 26 limit 1
---
    public function dashboard()
{
    $user = Auth::user();

    if ($user->user_type == 'customer') {

        $kyc = Userkyc::firstOrCreate(
            ['user_id' => $user->id],
            ['is_bank' => 2, 'is_aadhar' => 2, 'is_pan' => 2]
        );

        if ($user->is_kyc != 1) {
            $nextStep = $this->getNextKycStep($kyc);
            if ($nextStep > 0) {
                return redirect()->route('user.kyc', ['step' => $nextStep]);
            }
        }

        // Normal customer dashboard
        $users_cart = Cart::where('user_id', $user->id)->first();

select * from `brands` where `brands`.`id` in (1)
select * from `products` where `auction_product` = 0 and `slug` = 'new-lehanga' and `approved` = 1 limit 1
select * from `reviews` where `reviews`.`product_id` in (29)
select * from `shops` where `shops`.`user_id` in (9)
select count(*) as aggregate from `product_queries` where `product_id` = 29 and `customer_id` != 26
select count(*) as aggregate from `product_queries` where `product_id` = 29
select count(*) as aggregate from `reviews` where `reviews`.`product_id` = 29 and `reviews`.`product_id` is not null and `status` = 1
---
    public function product(Request $request, $slug)
    {
        if (!Auth::check()) {
            session(['link' => url()->current()]);
        }

        $detailedProduct  = Product::with('reviews', 'brand', 'stocks', 'user', 'user.shop')->where('auction_product', 0)->where('slug', $slug)->where('approved', 1)->first();

        if ($detailedProduct != null && $detailedProduct->published) {
            if ((get_setting('vendor_system_activation') != 1) && $detailedProduct->added_by == 'seller') {
                abort(404);
            }

            if ($detailedProduct->added_by == 'seller' && $detailedProduct->user->banned == 1) {
                abort(404);
            }

            if (!addon_is_activated('wholesale') && $detailedProduct->wholesale_product == 1) {
                abort(404);
            }

            $product_queries = ProductQuery::where('product_id', $detailedProduct->id)->where('customer_id', '!=', Auth::id())->latest('id')->paginate(3);
            $total_query = ProductQuery::where('product_id', $detailedProduct->id)->count();
            $reviews = $detailedProduct->reviews()->where('status', 1)->orderBy('created_at', 'desc')->paginate(3);

select * from `order_details` where `product_id` = 29 and `delivery_status` = 'delivered' limit 1
select * from `orders` where `orders`.`id` in (16) and `user_id` = 26
---
            $review_status = 0;
            $order_id = '';
            if (Auth::check()) {
                $OrderDetail = OrderDetail::with(['order' => function ($q) {
                    $q->where('user_id', Auth::id());
                }])->where('product_id', $detailedProduct->id)->where('delivery_status', 'delivered')->first();

select * from `products` where `products`.`id` = '29' limit 1
---
    public function variant_price(Request $request)
    {
        $product = Product::find($request->id);

select * from `products` where `slug` = 'new-lehanga' and `approved` = 1 limit 1
select count(*) as aggregate from `reviews` where `reviews`.`product_id` = 29 and `reviews`.`product_id` is not null and `status` = 1
select * from `reviews` where `reviews`.`product_id` = 29 and `reviews`.`product_id` is not null and `status` = 1 order by `created_at` desc limit 3
---
    public function product_reviews(Request $request) {
        $detailedProduct = Product::where('slug', $request->slug)
            ->where('approved', 1)
            ->firstOrFail();
        $query = $detailedProduct->reviews()->where('status', 1);
        switch ($request->sort_by) {
            case 'oldest':
                $query->orderBy('created_at', 'asc');
                break;
            case 'higest':
                $query->orderBy('rating', 'desc');
                break;
            case 'lowest':
                $query->orderBy('rating', 'asc');
                break;
            case 'newest':
            default:
                $query->orderBy('created_at', 'desc');
                break;
        }

        $limit = (int) $request->limit ?: 3;
        //Log:: info('Limit: ' . $limit);
        $totalReviews = $detailedProduct->reviews()->where('status', 1)->count();
        // Get the results
        if ($request->has('rating') && $request->rating != '') {
            $query->where('rating', $request->rating);
        }
        $reviews = $query->take($limit)->get();

select * from `user_kyc` where (`user_id` = 41) and `user_kyc`.`deleted_at` is null limit 1
---
public function agentLoginSubmit(Request $request)
{
    $credentials = [
    'email' => $request->email,
    'password' => $request->password,
    'user_type' => 'agent'
];

    if(Auth::attempt($credentials))
    {
        $user = Auth::user();

        $kyc = Userkyc::firstOrCreate(
            ['user_id' => $user->id],
            [
                'is_bank' => 2,
                'is_aadhar' => 2,
                'is_pan' => 2
            ]
        );