app/Http/Controllers/KYCController.php

select * from `user_kyc` where (`user_id` = 55) and `user_kyc`.`deleted_at` is null limit 1
---
    public function index(Request $request)
{
    $userId = Auth::id();
    $kyc = Userkyc::firstOrCreate(
        ['user_id' => $userId],
        ['is_bank'=>2,'is_aadhar'=>2,'is_pan'=>2]
    );

update `user_kyc` set `aadhar` = '123467432111', `aadhar_front` = '1781675875_aadhar_front_login-removebg-preview.png', `aadhar_back` = '1781675875_aadhar_back_Dummy Pg Logos.png', `is_aadhar` = 1, `user_kyc`.`updated_at` = '2026-06-17 11:27:55' where `user_id` = 56 and `user_kyc`.`deleted_at` is null
---
        );
    }

    Userkyc::where('user_id', $userId)->update([
        'aadhar'        => $request->aadhar,
        'aadhar_front'  => $frontImage,
        'aadhar_back'   => $backImage,
        'is_aadhar'     => 1,
    ]);

update `user_kyc` set `pan` = '12243243', `pan_front` = '1781674726_pan_front_login.webp', `pan_back` = '1781674726_pan_back_login-removebg-preview.png', `is_pan` = 1, `user_kyc`.`updated_at` = '2026-06-17 11:08:46' where `user_id` = 55 and `user_kyc`.`deleted_at` is null
select * from `user_kyc` where `user_id` = 55 and `user_kyc`.`deleted_at` is null limit 1
---
        );
    }

    Userkyc::where('user_id', $userId)->update([
        'pan'        => $request->pan,
        'pan_front'  => $frontImage,
        'pan_back'   => $backImage,
        'is_pan'     => 1,
    ]);

    $kyc = Userkyc::where('user_id', $userId)->first();

update `users` set `is_kyc` = 1, `users`.`updated_at` = '2026-06-17 11:08:46' where `id` = 55
---
        $kyc->is_pan == 1
    ) {

        User::where('id', $userId)->update([
            'is_kyc' => 1
        ]);