app/Http/Controllers/MLMUserController.php

public function userwallet()
{
   $user = User::find(auth()->id());

    /*
    |--------------------------------------------------------------------------
    | MLM BLOCK CHECK
    |--------------------------------------------------------------------------
    */
    if ($user->mlm_status == 'blocked') {

        return view(
            'frontend.user.mlm_wallet',
            [
                'isBlocked' => true,
                'blockedAt' => $user->mlm_blocked_at
            ]
        );
    }

    $user_id = auth()->id();

    $user = User::find($user_id);
---
select * from `users` where `users`.`id` = 26 limit 1

    /* =========================
       WALLET TOTALS
    ========================= */
  $totalEarning = DB::table('mlm_wallet')
    ->where('user_id', $user_id)
    ->where('wallet_status', 1)
    ->sum('pt_value');

$totalWithdrawn = DB::table('mlm_withdraw_requests')
    ->where('user_id', $user_id)
    ->where('status', 'approved')
    ->sum('amount');

$totalWalletUsed = DB::table('orders')
    ->where('user_id', $user_id)
    ->sum('mlm_wallet_used');
---
select sum(`pt_value`) as aggregate from `mlm_wallet` where `user_id` = 27 and `wallet_status` = 1
select sum(`amount`) as aggregate from `mlm_withdraw_requests` where `user_id` = 27 and `status` = 'approved'
select sum(`mlm_wallet_used`) as aggregate from `orders` where `user_id` = 27

    $confirmedAmount = 0;
}

    $holdAmount = DB::table('mlm_wallet')
        ->where('user_id', $user_id)
        ->where('wallet_status', 2)
        ->sum('pt_value');
$earning = DB::table('mlm_wallet')
    ->where('user_id', $user_id)
    ->where('wallet_status', 1)
    ->sum('pt_value');

$withdrawn = DB::table('mlm_withdraw_requests')
    ->where('user_id', $user_id)
    ->whereIn('status', ['pending','approved'])
    ->sum('amount');

$totalWalletUsed = DB::table('orders')
    ->where('user_id', $user_id)
    ->sum('mlm_wallet_used');
---
select sum(`pt_value`) as aggregate from `mlm_wallet` where `user_id` = 27 and `wallet_status` = 2
select sum(`pt_value`) as aggregate from `mlm_wallet` where `user_id` = 27 and `wallet_status` = 1
select sum(`amount`) as aggregate from `mlm_withdraw_requests` where `user_id` = 26 and `status` in ('pending', 'approved')
select sum(`mlm_wallet_used`) as aggregate from `orders` where `user_id` = 27


    if ($level == 1) {

        $users = User::where('referred_by', auth()->id())->get();

    } else {

        $parentIds = User::where('referred_by', auth()->id())
            ->pluck('id')
            ->toArray();

        for ($i = 2; $i <= $level; $i++) {
            $parentIds = User::whereIn('referred_by', $parentIds)
                ->pluck('id')
                ->toArray();
        }

        $users = User::whereIn('id', $parentIds)->get();
---
select * from `users` where `referred_by` = 26
select `id` from `users` where `referred_by` = 27
select `id` from `users` where `referred_by` in (28)
select * from `users` where `id` in (28)


    foreach ($users as $u) {

        $u->level1_orders = DB::table('mlm_wallet')
            ->where('user_id', $u->id)
            ->where('level', 1)
            ->whereNotNull('order_id')
            ->distinct()
            ->count('order_id');
    }

    $orderCount = $users->sum('level1_orders');
---
select count(distinct `order_id`) as aggregate from `mlm_wallet` where `user_id` = 27 and `level` = 1 and `order_id` is not null
select count(*) as aggregate from `orders` where `user_id` in (28)

public function withdrawRequest(Request $request)
{
    $request->validate([
        'amount' => 'required|numeric|min:1'
    ]);

$user_id = auth()->id();

$refundedAmount = User::where('id', $user_id)
    ->value('mlm_wallet') ?? 0;

$totalEarning = DB::table('mlm_wallet')
    ->where('user_id', $user_id)
    ->where('wallet_status', 1)
    ->sum('pt_value');

$totalWithdrawn = DB::table('mlm_withdraw_requests')
    ->where('user_id', $user_id)
    ->whereIn('status', ['pending','approved'])
    ->sum('amount');

$totalWalletUsed = DB::table('orders')
    ->where('user_id', $user_id)
    ->sum('mlm_wallet_used');
---
select `mlm_wallet` from `users` where `id` = 26 limit 1
select sum(`pt_value`) as aggregate from `mlm_wallet` where `user_id` = 26 and `wallet_status` = 1
select sum(`amount`) as aggregate from `mlm_withdraw_requests` where `user_id` = 26 and `status` in ('pending', 'approved')
select sum(`mlm_wallet_used`) as aggregate from `orders` where `user_id` = 26

    return back();
}

    DB::table('mlm_withdraw_requests')->insert([

        'user_id' => auth()->id(),

        'amount' => $request->amount,

        'status' => 'pending',

        'created_at' => now(),

        'updated_at' => now()

    ]);
---
insert into `mlm_withdraw_requests` (`user_id`, `amount`, `status`, `created_at`, `updated_at`) values (26, '1', 'pending', '2026-06-17 14:43:16', '2026-06-17 14:43:16')