app/Http/Controllers/OrderController.php

    private function storeMlmIncome($orderId)
{
    try {

        $order = Order::find($orderId);

        if (!$order) {
            return;
        }

        $buyer = User::find($order->user_id);

        if (!$buyer) {
            return;
        }

        $orderDetails = OrderDetail::where('order_id', $orderId)->get();

        foreach ($orderDetails as $detail) {

            $mlmPrize = ProductMLMPrize::where(
                'product_id',
                $detail->product_id
            )->first();
---
select * from `orders` where `orders`.`id` = 103 limit 1
select * from `users` where `users`.`id` = 28 limit 1
select * from `order_details` where `order_id` = 103
select * from `product_mlm_prize` where `product_id` = 29 and `product_mlm_prize`.`deleted_at` is null limit 1

            |--------------------------------------------------------------------------
            */

            MLMWallet::create([

                'user_id'       => $buyer->id,
                'order_id'      => $order->id,
                'product_id'    => $detail->product_id,
                'pt_coins'      => $mlmPrize->coins,
                'pt_value'      => $mlmPrize->level0 ?? 0,
                'level'         => 0,
                'wallet_status' => 2,

            ]);
---
insert into `mlm_wallet` (`user_id`, `order_id`, `product_id`, `pt_coins`, `pt_value`, `level`, `wallet_status`, `updated_at`, `created_at`) values (28, 103, 29, '500', '100', 0, 2, '2026-06-17 13:22:57', '2026-06-17 13:22:57')

                    break;
                }

                $referralUser = User::find($currentReferralId);
---
select * from `users` where `users`.`id` = 27 limit 1


                $levelColumn = 'level'.$level;

                MLMWallet::create([

                    'user_id'       => $referralUser->id,
                    'order_id'      => $order->id,
                    'product_id'    => $detail->product_id,
                    'pt_coins'      => $mlmPrize->coins,
                    'pt_value'      => $mlmPrize->$levelColumn ?? 0,
                    'level'         => $level,
                    'wallet_status' => 2,

                ]);
---
insert into `mlm_wallet` (`user_id`, `order_id`, `product_id`, `pt_coins`, `pt_value`, `level`, `wallet_status`, `updated_at`, `created_at`) values (27, 103, 29, '500', '0.8', 1, 2, '2026-06-17 13:22:57', '2026-06-17 13:22:57')

    public function store(Request $request)
    {
        $carts = Cart::where('user_id', Auth::user()->id)->active()->get();

        if ($carts->isEmpty()) {
            flash(translate('Your cart is empty'))->warning();
            return redirect()->route('home');
        }

        $address = Address::where('id', $carts[0]['address_id'])->first();
        $billing_address = Address::where('id', $carts[0]['billing_address'])->first();
---
select * from `addresses` where `id` = 5 limit 1
select * from `addresses` where `id` = 0 limit 1

        $seller_products = array();
        foreach ($carts as $cartItem) {
            $product_ids = array();
            $product = Product::find($cartItem['product_id']);
---
select * from `products` where `products`.`id` = 29 limit 1


            //Order Details Storing
            foreach ($seller_product as $cartItem) {
                $product = Product::find($cartItem['product_id']);
---
select * from `products` where `products`.`id` = 29 limit 1