app/Http/Controllers/PurchaseHistoryController.php

    public function filterOrders(Request $request)
    {
        $tab = $request->tab;
        $query = Order::with('orderDetails')
            ->where('user_id', Auth::id())
            ->orderBy('code', 'desc');

        if ($tab && $tab !== 'all') {
            match ($tab) {
                'unpaid' => $query->where('payment_status', 'unpaid'),
                'to_review' => $query->whereHas(
                    'orderDetails',
                    fn($q) =>
                    $q->where('reviewed', 0)->where('delivery_status', 'delivered')
                ),
                default => $query->where('delivery_status', $tab),
            };
        }

        $orders = $query->paginate(10)->withQueryString();
---
select * from `order_details` where `order_details`.`order_id` in (17, 28, 31, 33, 34, 35, 103)
select * from `orders` where `user_id` = 28 order by `code` desc limit 10 offset 0
select count(*) as aggregate from `orders` where `user_id` = 28